Autodesk.Revit.DB.Frame
Represents a coordinate frame of reference.
Remarks:
A Frame consists of three vectors at a base point in 3D space.
The vectors need not be orthogonal, have unit length, or even be linearly
independent, although in practice Frames will usually have linearly
independent vectors.
Since:
2012